{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [1, 3], "name": "dense/kernel"}, {"dtype": "float32", "shape": [3], "name": "dense/bias"}, {"dtype": "float32", "shape": [3, 3], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [3], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [3, 1], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_2/bias"}]}], "modelTopology": {"training_config": {"metrics": null, "loss": "mean_squared_error", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.009999999776482582, "amsgrad": false}}, "weighted_metrics": null, "loss_weights": null}, "keras_version": "2.5.0", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 1], "name": "dense_input", "sparse": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "batch_input_shape": [null, 1], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "format": "layers-model"}